
// Описание
// 
// Параметры:
// 	ТекПользователь - ПользовательИнформационнойБазы - 
// Возвращаемое значение:
// 	
Функция НайтиИлиДобавитьПользователя(ТекПользователь) Экспорт
	Пользователь = НайтиПоНаименованию(ТекПользователь.Имя);
	
	Если (Пользователь.Пустая()) Тогда
		НовыйПользователь = СоздатьЭлемент();
		НовыйПользователь.Наименование = ТекПользователь.Имя;
		НовыйПользователь.ПолноеИмя = ТекПользователь.ПолноеИмя;
		
		НовыйПользователь.ЗаполнитьТаблицуПрав(ТекПользователь);
		НовыйПользователь.Записать();
		
		Пользователь = НовыйПользователь.Ссылка;
	КонецЕсли;
			
	Возврат Пользователь;
	
КонецФункции













