
Процедура ПередЗаписью(Отказ)
	
	ТекПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если ТекПользователь = Неопределено Тогда
		ТекПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		ТекПользователь.Имя = Наименование;
		ТекПользователь.ПолноеИмя = ПолноеИмя;
	КонецЕсли;
	
	СписокРолей = СписокПрав.НайтиСтроки( Новый Структура("Активна", Истина) );
	Для Каждого СтрокаТЧ Из СписокРолей Цикл
		ТекПользователь.Роли.Добавить(Метаданные.Роли.Найти(СтрокаТЧ.ИмяРоли));		
	КонецЦикла;
	ТекПользователь.Записать();
	
КонецПроцедуры


// Описание
// 
// Параметры:
// 	ТекПользователь - ПользовательИнформационнойБазы -
Процедура ЗаполнитьТаблицуПрав( ТекПользователь ) Экспорт
	
	СписокПрав.Очистить();
	
	НаборРолей = Метаданные.Роли;
	
	Для Каждого ТекРоль Из НаборРолей Цикл
		СтрокаТЧ = СписокПрав.Добавить();
		СтрокаТЧ.ИмяРоли = ТекРоль.Имя;
		СтрокаТЧ.ПредставлениеРоли = ТекРоль.Синоним;
		СтрокаТЧ.Активна = ТекПользователь.Роли.Содержит(ТекРоль);						
	КонецЦикла;
	
КонецПроцедуры